s = int(input('Сумма кредита, руб.: '))
n = int(input('Срок кредита, месяцев: '))
k = int(input('процентная ставка: '))


def compute_payment(t):
    pay_t = s/n + (s - (t - 1) * (s/n)) * k / 1200
    return pay_t


total = 0
for t in range(1, n + 1):
    print('%2d месяц - %8.2f руб' % (t, compute_payment(t)))
    total += compute_payment(t)
print("Доход банка - %6.2f руб" % (total - s))

"""
Сумма кредита, руб.: 20000

Срок кредита, месяцев: 12

процентная ставка: 9
 1 месяц -  1816.67 руб
 2 месяц -  1804.17 руб
 3 месяц -  1791.67 руб
 4 месяц -  1779.17 руб
 5 месяц -  1766.67 руб
 6 месяц -  1754.17 руб
 7 месяц -  1741.67 руб
 8 месяц -  1729.17 руб
 9 месяц -  1716.67 руб
10 месяц -  1704.17 руб
11 месяц -  1691.67 руб
12 месяц -  1679.17 руб
Доход банка - 975.00 руб """
